#### BuiltInFailures.AutoJoinFailures Members

---

|  |
| --- |
| BuiltInFailures AutoJoinFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures AutoJoinFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | DesignOptionAndWorksetViolation | Can't make the expected join because of editability and design option restrictions. |
| Public property Static member | DesignOptionCannotReference | Design Option ' [Name] ' cannot reference Design Option ' [Name] '. |
| Public property Static member | OtherNonEditJoinFailure | Two elements were not automatically joined because other elements at join are not editable. |
| Public property Static member | UnexpectedJoinFailure | Join failure caused by editability or design option related problem. |
| Public property Static member | Unknown | Unknown |
| Public property Static member | WorksetJoinWarn | Two elements were not automatically joined because one or both is not editable. |

# See Also

BuiltInFailures AutoJoinFailures Class

Autodesk.Revit.DB Namespace